aaron-bond.better-comments
akamud.vscode-theme-onedark
alefragnani.project-manager
arcticicestudio.nord-visual-studio-code
be5invis.vscode-custom-css
bodil.file-browser
brandonkirbyson.vscode-animations
catppuccin.catppuccin-vsc
christian-kohler.path-intellisense
cl.eide
continue.continue
cschlosser.doxdocgen
dan-c-underwood.arm
davidanson.vscode-markdownlint
donjayamanne.python-environment-manager
dracula-theme.theme-dracula
drcika.apc-extension
eamodio.gitlens
ebicochineal.select-highlight-cochineal-color
esbenp.prettier-vscode
fittentech.fitten-code
frhtylcn.pythonsnippets
gerrnperl.outline-map
gimjin.banjiao
github.remotehub
gruntfuggly.todo-tree
hars.cppsnippets
intellsmi.comment-translate
jacobdufault.fuzzy-search
kahole.magit
llvm-vs-code-extensions.vscode-clangd
mhutchie.git-graph
monokai.theme-monokai-pro-vscode
ms-ceintl.vscode-language-pack-zh-hans
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.vscode-serial-monitor
njpwerner.autodocstring
opensim.omnetpp-vscode
redhat.vscode-xml
redhat.vscode-yaml
redjue.git-commit-plugin
richie5um2.vscode-sort-json
ritwickdey.liveserver
sumneko.lua
tamasfe.even-better-toml
tokiumjp.vscode-dict
tomoki1207.pdf
trond-snekvik.gnu-mapfiles
twxs.cmake
usernamehw.errorlens
vscodevim.vim
vspacecode.vspacecode
vspacecode.whichkey
vue.volar
yzhang.dictionary-completion
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
