2211896472.snippets
aaron-bond.better-comments
abdalmoniem-alhifnawy.c-call-hierarchy
adpyke.vscode-sql-formatter
affenwiesel.matlab-formatter
akamud.vscode-theme-onelight
alefragnani.bookmarks
alefragnani.project-manager
analytic-signal.preview-tiff
apommel.matlab-interactive-terminal
beishanyufu.ime-and-cursor
bierner.markdown-preview-github-styles
brandonkirbyson.vscode-animations
briancbarrow.blue-quiet-light
chenperach.c-cpp-cmake-project-creator
cl.eide
cnyballk.wxml-vscode
cschlosser.doxdocgen
dan-c-underwood.arm
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
debian001.app-migrator
dracula-theme.theme-dracula
draivin.hscopes
drcika.apc-extension
dzhavat.bracket-pair-toggler
eamodio.gitlens
ebicochineal.select-highlight-cochineal-color
equinusocio.moxer-icons
equinusocio.vsc-community-material-theme
equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
fehey.brackets-light-pro
fittentech.fitten-code
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
gimly81.matlab
github.copilot
github.copilot-chat
github.remotehub
gitpod.gitpod-desktop
gruntfuggly.todo-tree
iamhyc.overleaf-workshop
ibm.output-colorizer
intellsmi.comment-translate
james-yu.latex-workshop
jdinhlife.gruvbox
kamikillerto.vscode-colorize
keroc.hex-fmt
kevinrose.vsc-python-indent
leetcode.vscode-leetcode
llvm-vs-code-extensions.vscode-clangd
marus25.cortex-debug
mateuszchudyk.hexinspector
mcu-debug.debug-tracker-vscode
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
mechatroner.rainbow-csv
mhutchie.git-graph
midnightsyntax.vscode-wrap-console-log
mightbesimon.emoji-icons
mohsen1.prettify-json
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-zh-hans
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.vscode-embedded-tools
ms-vscode.vscode-serial-monitor
njpwerner.autodocstring
oderwat.indent-rainbow
pkief.material-icon-theme
pranaygp.vscode-css-peek
qiu8310.minapp-vscode
redhat.fabric8-analytics
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
redjue.git-commit-plugin
rifi2k.format-html-in-php
ritwickdey.liveserver
sandorengholm.csspreview
shd101wyy.markdown-preview-enhanced
sitoi.ai-commit
skyran.matlab-snippets
sonarsource.sonarlint-vscode
sumneko.lua
svenzhao.var-translation
tamasfe.even-better-toml
teabyii.ayu
trabpukcip.vscode-npm-scripts
trond-snekvik.gnu-mapfiles
twxs.cmake
usernamehw.errorlens
vincaslt.highlight-matching-tag
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
vscodevim.vim
vue.volar
wicked-labs.wvsc-serendipity
xabikos.javascriptsnippets
xaver.clang-format
xiaoyongdong.srecord
yzhang.dictionary-completion
yzhang.markdown-all-in-one
zainchen.json
zhuangtongfa.material-theme
zixuanwang.linkerscript
